// RingBuffer.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include<vector>

int main()
{
    setlocale(LC_ALL, "RU_ru");
    std::cout << "Кольцевой буфер!\nПри вводе -1 печатается содержимое буфера\nПри вводе -2 - выход из программы.\n";
    std::vector<int> db(20);
    int item = 0;
    int count = 0;
    while (item != -2)
    {
        std::cout << "Введите число: ";
        std::cin >> item;
        if (item == -1)
        {
            std::cout << "output: ";
            for (int i = count % 20; i < 20; ++i)
            {
                std::cout << db[i] << " ";
            }
            for (int i = 0; i < count % 20; ++i)
            {
                std::cout << db[i] << " ";
            }
            std::cout << "\n";
        }
        else
        {
            db[count % 20] = item;
            ++count;
        }
    }
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
